Revit 2026 API

# ParameterFilterElementCreate(Document, String, ICollectionElementId, ElementFilter) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ParameterFilterElement Create(
	Document aDocument,
	string name,
	ICollection<ElementId> categories,
	ElementFilter elementFilter
)
```
```vb
Public Shared Function Create (
	aDocument As Document,
	name As String,
	categories As ICollection(Of ElementId),
	elementFilter As ElementFilter
) As ParameterFilterElement
```
```cpp
public:
static ParameterFilterElement^ Create(
	Document^ aDocument,
	String^ name,
	ICollection<ElementId^>^ categories,
	ElementFilter^ elementFilter
)
```
```fsharp
static member Create :
        aDocument : Document *
        name : string *
        categories : ICollection<ElementId> *
        elementFilter : ElementFilter -> ParameterFilterElement
```

#### Parameters

aDocument Document

name String

categories ICollectionElementId

elementFilter ElementFilter

#### Return Value

ParameterFilterElement

#### Reference

ParameterFilterElement Class

Create Overload

Autodesk.Revit.DB Namespace